# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ipnet = input("Введите адрес сети: ") #"10.1.1.0/24"
net = ipnet.split('/')[0].split('.')
mask = ipnet.split('/')[1]
bimask = "1" * int(mask) + "0" * (32 - int(mask))
nettemp = '''
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
'''
masktemp = '''
Mask:
/{0}
{1:<10}{2:<10}{3:<10}{4:<10}
{1:08b}  {2:08b}  {3:08b}  {4:08b}
'''
print(nettemp.format(int(net[0]), int(net[1]), int(net[2]), int(net[3])))
print(masktemp.format(mask, int(bimask[0:8], 2), int(bimask[8:16], 2), int(bimask[16:24], 2), int(bimask[24:], 2)))
#print('Network:\n{0:<10}{1:<10}{2:<10}{3:<10}\n{0:08b}  {1:08b}  {2:08b}  {3:08b}'.format(int(net[0]), int(net[1]), int(net[2]), int(net[3])))
#print('\nMask:\n/{0}\n{1:<10}{2:<10}{3:<10}{4:<10}\n{1:08b}  {2:08b}  {3:08b}  {4:08b}'.format(mask, int(bimask[0:8], 2), int(bimask[8:16], 2),
#int(bimask[16:24], 2), int(bimask[24:], 2), ))